## Production: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 27 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                           NAME                                                           |
|--------|--------------------------------------------------------------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_group.ai_answers_group`                                                                              |
|        | `aws_cloudwatch_log_stream.ai_answers_stream`                                                                            |
|        | `aws_security_group.ecs_tasks`                                                                                           |
|        | `aws_security_group_rule.database_ingress_ecs`                                                                           |
|        | `aws_security_group_rule.ecs_egress_all`                                                                                 |
|        | `aws_security_group_rule.ecs_egress_database`                                                                            |
|        | `aws_security_group_rule.ecs_ingress_lb`                                                                                 |
|        | `module.ai_answers.aws_appautoscaling_policy.this[&quot;cpu&quot;]`                                                                |
|        | `module.ai_answers.aws_appautoscaling_policy.this[&quot;memory&quot;]`                                                             |
|        | `module.ai_answers.aws_appautoscaling_target.this[0]`                                                                    |
|        | `module.ai_answers.aws_cloudwatch_log_group.this`                                                                        |
|        | `module.ai_answers.aws_cloudwatch_log_subscription_filter.this_sentinel_forwarder[0]`                                    |
|        | `module.ai_answers.aws_ecs_cluster.this[0]`                                                                              |
|        | `module.ai_answers.aws_ecs_cluster_capacity_providers.this[0]`                                                           |
|        | `module.ai_answers.aws_ecs_service.this`                                                                                 |
|        | `module.ai_answers.aws_ecs_task_definition.this`                                                                         |
|        | `module.ai_answers.aws_iam_policy.this_task_exec`                                                                        |
|        | `module.ai_answers.aws_iam_role.this_task`                                                                               |
|        | `module.ai_answers.aws_iam_role.this_task_exec`                                                                          |
|        | `module.ai_answers.aws_iam_role_policy_attachment.this_task_exec`                                                        |
|        | `module.ai_answers.module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda`                      |
|        | `module.ai_answers.module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda`                                |
|        | `module.ai_answers.module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda`                                  |
|        | `module.ai_answers.module.sentinel_forwarder[0].aws_iam_role_policy_attachment.sentinel_forwarder_lambda`                |
|        | `module.ai_answers.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder`                                  |
|        | `module.ai_answers.module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0]` |
|        | `module.ai_answers.module.sentinel_forwarder[0].aws_ssm_parameter.sentinel_forwarder_auth`                               |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/ai-answers/actions/runs/14066531994).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.ai_answers_group will be created
  + resource "aws_cloudwatch_log_group" "ai_answers_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/ai-answers-production-cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_stream.ai_answers_stream will be created
  + resource "aws_cloudwatch_log_stream" "ai_answers_stream" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + log_group_name = "/aws/ecs/ai-answers-production-cluster"
      + name           = "ai-answers-production-log-stream"
    }

  # aws_security_group.ecs_tasks will be created
  + resource "aws_security_group" "ecs_tasks" {
      + arn                    = (known after apply)
      + description            = "Allow inbound and outbound traffic for ai-answers production"
      + egress                 = []
      + id                     = (known after apply)
      + ingress                = []
      + name                   = "ai-answers-production-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "ai-answers-prod"
        }
      + tags_all               = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.database_ingress_ecs will be created
  + resource "aws_security_group_rule" "database_ingress_ecs" {
      + description              = "Allow DocumentDB cluster to receive requests from ECS"
      + from_port                = 27017
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 27017
      + type                     = "ingress"
        # (1 unchanged attribute hidden)
    }

  # aws_security_group_rule.ecs_egress_all will be created
  + resource "aws_security_group_rule" "ecs_egress_all" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow ECS security group to send all traffic"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.ecs_egress_database will be created
  + resource "aws_security_group_rule" "ecs_egress_database" {
      + description              = "Allow ECS to talk to the DocumentDB cluster"
      + from_port                = 27017
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 27017
      + type                     = "egress"
    }

  # aws_security_group_rule.ecs_ingress_lb will be created
  + resource "aws_security_group_rule" "ecs_ingress_lb" {
      + description              = "Allow the ecs security group to receive traffic only from the load balancer on port 3001"
      + from_port                = 3001
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3001
      + type                     = "ingress"
    }

  # module.ai_answers.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + inference_accelerator    = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "ai-answers-production-task"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.ai_answers.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
        ]
    }

  # module.ai_answers.data.aws_iam_policy_document.this_task_exec_logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:DescribeLogGroups",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.ai_answers.aws_appautoscaling_policy.this["cpu"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/ai-answers-production-cluster/ai-answers-production-app-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 60

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ai_answers.aws_appautoscaling_policy.this["memory"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/ai-answers-production-cluster/ai-answers-production-app-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 60

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ai_answers.aws_appautoscaling_target.this[0] will be created
  + resource "aws_appautoscaling_target" "this" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 2
      + min_capacity       = 1
      + resource_id        = "service/ai-answers-production-cluster/ai-answers-production-app-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags               = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all           = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }

      + suspended_state (known after apply)
    }

  # module.ai_answers.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/ai-answers-production-cluster/ai-answers-production-app-service"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
    }

  # module.ai_answers.aws_cloudwatch_log_subscription_filter.this_sentinel_forwarder[0] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "this_sentinel_forwarder" {
      + destination_arn = (known after apply)
      + distribution    = "Random"
      + filter_pattern  = "[w1=\"*\"]"
      + id              = (known after apply)
      + log_group_name  = "/aws/ecs/ai-answers-production-cluster/ai-answers-production-app-service"
      + name            = "All cluster logs"
      + role_arn        = (known after apply)
    }

  # module.ai_answers.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "ai-answers-production-cluster"
      + tags     = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ai_answers.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "FARGATE",
        ]
      + cluster_name       = "ai-answers-production-cluster"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE"
          + weight            = 1
        }
    }

  # module.ai_answers.aws_ecs_service.this will be created
  + resource "aws_ecs_service" "this" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "ai-answers-production-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "ai-answers-production-app-service"
      + platform_version                   = "LATEST"
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_controller {
          + type = "ECS"
        }

      + load_balancer {
          + container_name   = "ai-answers-production"
          + container_port   = 3001
            # (2 unchanged attributes hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + null,
            ]
        }
    }

  # module.ai_answers.aws_ecs_task_definition.this will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + essential              = true
                  + image                  = ":latest"
                  + logConfiguration       = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/ai-answers-production-cluster/ai-answers-production-app-service"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "task"
                        }
                    }
                  + mountPoints            = []
                  + name                   = "ai-answers-production"
                  + portMappings           = [
                      + {
                          + containerPort = 3001
                          + hostPort      = 3001
                          + protocol      = "tcp"
                        },
                    ]
                  + readonlyRootFilesystem = false
                  + secrets                = [
                      + {
                          + name      = "AZURE_OPENAI_API_KEY"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "AZURE_OPENAI_API_VERSION"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "AZURE_OPENAI_ENDPOINT"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "CANADA_CA_SEARCH_API_KEY"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "CANADA_CA_SEARCH_URI"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "DOCDB_URI"
                          + valueFrom = "mock_docdb_uri_arn"
                        },
                      + {
                          + name      = "JWT_SECRET_KEY"
                          + valueFrom = ""
                        },
                      + {
                          + name      = "USER_AGENT"
                          + valueFrom = ""
                        },
                    ]
                  + systemControls         = []
                  + ulimits                = [
                      + {
                          + hardLimit = 1000000
                          + name      = "nofile"
                          + softLimit = 1000000
                        },
                    ]
                  + volumesFrom            = []
                },
            ]
        )
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + family                   = "ai-answers-production-task"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + track_latest             = false
        # (2 unchanged attributes hidden)

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # module.ai_answers.aws_iam_policy.this_task_exec will be created
  + resource "aws_iam_policy" "this_task_exec" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "ai-answers-production-task_ecs_task_exec_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
    }

  # module.ai_answers.aws_iam_role.this_task will be created
  + resource "aws_iam_role" "this_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ai-answers-production-task_ecs_task_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ai_answers.aws_iam_role.this_task_exec will be created
  + resource "aws_iam_role" "this_task_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ai-answers-production-task_ecs_task_exec_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ai_answers.aws_iam_role_policy_attachment.this_task_exec will be created
  + resource "aws_iam_role_policy_attachment" "this_task_exec" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ai-answers-production-task_ecs_task_exec_role"
    }

  # module.ai_answers.module.sentinel_forwarder[0].data.aws_iam_policy_document.sentinel_forwarder_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sentinel_forwarder_lambda" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "xray:GetSamplingRules",
              + "xray:GetSamplingStatisticSummaries",
              + "xray:GetSamplingTargets",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.ai_answers.module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda will be created
  + resource "aws_cloudwatch_log_group" "sentinel_forwarder_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/ai-answers-production-cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "ai-answers-prod"
        }
      + tags_all          = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
    }

  # module.ai_answers.module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda will be created
  + resource "aws_iam_policy" "sentinel_forwarder_lambda" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "SentinelForwarderLambda-ai-answers-production-cluster"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
    }

  # module.ai_answers.module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda will be created
  + resource "aws_iam_role" "sentinel_forwarder_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SentinelForwarderLambda-ai-answers-production-cluster"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ai_answers.module.sentinel_forwarder[0].aws_iam_role_policy_attachment.sentinel_forwarder_lambda will be created
  + resource "aws_iam_role_policy_attachment" "sentinel_forwarder_lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SentinelForwarderLambda-ai-answers-production-cluster"
    }

  # module.ai_answers.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder will be created
  + resource "aws_lambda_function" "sentinel_forwarder" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Lambda function to forward AWS logs to Azure Sentinel"
      + filename                       = "/tmp/sentinel_forwarder.py.zip"
      + function_name                  = "ai-answers-production-cluster"
      + handler                        = "sentinel_forwarder.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:188",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "mfdZfYUgPWLo+yh9aU8f33p2Tg+J0YOaJr3kKgPNVhE="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "ai-answers-prod"
        }
      + tags_all                       = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.ai_answers.module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0] will be created
  + resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "ai-answers-production-cluster"
      + id                  = (known after apply)
      + principal           = "logs.ca-central-1.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromCloudWatchLogs-ai-answers-production-cluster-0"
      + statement_id_prefix = (known after apply)
    }

  # module.ai_answers.module.sentinel_forwarder[0].aws_ssm_parameter.sentinel_forwarder_auth will be created
  + resource "aws_ssm_parameter"...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ai_answers_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_ssm_parameter.sentinel_forwarder_auth"]

26 tests, 19 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
